// Задача 4: вывести на экран в диалоговом окне текст с сообщением 
// “Вам хорошо живется?”
// и кнопками «ОК», «Отмена», для чего необходимо использовать 
// confirm.
// - При нажатии на кнопку “ОК” вывести в диалоговом окне текст 
// с сообщением “Тогда мы идем к вам!”.
// - При нажатии на кнопку “Отмена” вывести в диалоговом окне 
// текст с сообщением “Ну вы держитесь там!”.
const result=confirm("Are your life is good?")
if (result){
    alert("then I'll go to you")
}else{
    alert("fell better yourself")
}